# ServiceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartBrowserChangedEventArgs..::..ServiceId Property
FabricationPartBrowserChangedEventArgs Class See Also
---
The identifier for the fabrication service.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int ServiceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceId As Integer
	Get
```

Visual C++
---
```text
public:
property int ServiceId {
	int get ();
}
```

# See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace